export const types = [
  { type: 'Обсяги споживання електроенергії', unit: 'кВт·год' },
  { type: 'Обсяги виробництва теплової енергії', unit: 'Гкал' },
  { type: 'Обсяги споживання теплової енергії', unit: 'Гкал' },
  { type: 'Обсяги споживання газу', unit: 'тис. м3' },
  { type: 'Обсяги споживання води', unit: 'тис. м3' },
  { type: 'Обсяги споживання бензину', unit: 'тон' },
  { type: 'Обсяги споживання мастильних матеріалів', unit: 'тон' },
  { type: 'Обсяги водовідведення', unit: 'тис. м3' },
  { type: 'Обсяги твердих побутових відходів', unit: 'тис. м3 / тон' },
  { type: 'Температура довкілля', unit: '0С' },
  { type: 'Обсяги виробництва продукції та послуг', unit: 'грн' },
  { type: 'Витрати на електроенергію', unit: 'грн' },
  { type: 'Обсяги продажів теплової енергії', unit: 'грн' },
  { type: 'Витрати на теплову енергію на власні потреби', unit: 'грн' },
  { type: 'Витрати на газ', unit: 'грн' },
  { type: 'Витрати на воду', unit: 'грн' },
  { type: 'Витрати на бензин', unit: 'грн' },
  { type: 'Витрати на мастильні матеріали', unit: 'грн' },
  { type: 'Витрати на водовідведення', unit: 'грн' },
  { type: 'Витрати на утилізацію твердих побутових відходів', unit: 'грн' },
];

export const months = [
  'Січень',
  'Лютий',
  'Березень',
  'Квітень',
  'Травень',
  'Червень',
  'Липень',
  'Серпень',
  'Вересень',
  'Жовтень',
  'Листопад',
  'Грудень',
];
export const randomNumber = (min, max, k) =>
  Math.random() * (max - min) + min > k * min
    ? Math.floor(Math.random() * (max - min) + min)
    : 0;
